/*
 Localization provided by Wordcrafts
 The Mac OS X and iOS localization experts.
 http://www.wordcrafts.de
 */


/* General */

/* For dialogs yes buttons */
"HockeyYes" = "Sim";

/* For dialogs no buttons */
"HockeyNo" = "Não";

/* For dialogs ok buttons */
"HockeyOK" = "OK";

/* Replacement for app name, if it could not be detected */
"HockeyAppNamePlaceholder" = "Esta aplicação";

/* Crash */


/* Crash dialog */

/* Title showing in the alert box when crash report data has been found */
"CrashDataFoundTitle" = "%@ fechou inesperadamente";

/* Description explaining that crash data has been found and ask the user if the data might be uploaded to the developers server */
"CrashDataFoundAnonymousDescription" = "Pretende enviar um relatório anónimo para que possamos resolver o problema?";

/* Description explaining that crash data has been found and ask the user if the non anonymous data might be uplaoded to the developers server */
"CrashDataFoundDescription" = "Pretende enviar um relatório para que possamos resolver o problema?";

/* Alert box button if the users wants to send crash data always automatically */
"CrashSendReportAlways" = "Enviar sempre";

/* Alert box button to send the crash report once */
"CrashSendReport" = "Enviar relatório";

/* Alert box button to decline sending the report */
"CrashDontSendReport" = "Não enviar";

/* Text showing in a processing box that the crash data is being uploaded to the server */
"CrashReportSending" = "A enviar...";


/* Update */


/* Update Alert view */

/* Update available */
"UpdateAvailable" = "Actualização disponível";

"UpdateAlertTextWithAppVersion" = "%@ está disponível.";

"UpdateAlertMandatoryTextWithAppVersion" = "%@ está disponível e é uma actualização obrigatória!";

"UpdateIgnore" = "Ignorar";

"UpdateShow" = "Mostrar";

"UpdateInstall" = "Instalar";

"UpdateRemindMe" = "Lembrar-me";


/* Update Details */

"UpdateScreenTitle" = "Actualização";

"UpdateButtonCheck" = "VERIFICAR";

"UpdateButtonSearching" = "A VERIFICAR";

"UpdateButtonUpdate" = "ACTUALIZAR";

"UpdateButtonInstalling" = "A INSTALAR";

"UpdateButtonOffline" = "OFFLINE";

"UpdateInstalled" = "INSTALADO";

"UpdateVersion" = "Versão";

"UpdateShowPreviousVersions" = "Mostrar versões anteriores...";

"UpdateNoUpdateAvailableTitle" = "Nenhuma actualização disponível";

"UpdateNoUpdateAvailableMessage" = "%@ é a mais recente.";

"UpdateError" = "Erro";

"UpdateWarning" = "Aviso";

"UpdateNoReleaseNotesAvailable" = "Nenhuma nota de lançamento disponível.";


/* Update Authorization  */

"UpdateAuthorizationProgress" = "A autorizar...";

"UpdateAuthorizationOffline" = "É necessária uma ligação à Internet!";

"UpdateAuthorizationDenied" = "Autorização negada. Contacte o programador.";


/* Update Expiry  */

"UpdateExpired" = "%@ expirou e já não pode ser utilizada.";


/* Update Simulator Warning */

"UpdateSimulatorMessage" = "A actualização do Hockey não funciona com o Simulador.\nO url scheme itms-services:// está implementado mas não funciona.";


/* Feedback */


/* New Message Alert */

/* Alert Title */
"HockeyFeedbackNewMessageTitle" = "Nova resposta a comentário";

/* Alert Text */
"HockeyFeedbackNewMessageText" = "Está disponível uma nova resposta ao seu comentário. Pretende vê-la?";

/* Alert Ignore Button */
"HockeyFeedbackIgnore" = "Ignorar";

/* Alert Show Button */
"HockeyFeedbackShow" = "Mostrar";


/* List View */

/* Title */
"HockeyFeedbackListTitle" = "Comentário";

/* Last Updated */
"HockeyFeedbackListLastUpdated" = "Última actualização: %@";

/* Never Updated */
"HockeyFeedbackListNeverUpdated" = "Nunca";

/* Provide Feedback Button Title */
"HockeyFeedbackListButtonWriteFeedback" = "Fornecer comentário";

/* Add a Response Button Title */
"HockeyFeedbackListButtonWriteResponse" = "Adicionar uma resposta";

/* User Data Set Name Button Title */
"HockeyFeedbackListButtonUserDataSetName" = "Definir nome";

/* User Data Set Email Button Title */
"HockeyFeedbackListButtonUserDataSetEmail" = "Definir e-mail";

/* User Data With Name Button Title */
"HockeyFeedbackListButtonUserDataWithName" = "Nome: %@";

/* User Data With Email Button Title */
"HockeyFeedbackListButtonUserDataWithEmail" = "E-mail: %@";

/* Button title for deleting all local messages*/
"HockeyFeedbackListButtonDeleteAllMessages" = "Eliminar todas as mensagens";

/* Message pending to be send */
"HockeyFeedbackListMessagePending" = "Pendente";


/* Delete All Messages Action Sheet / Alert View */

/* Title for the Action Sheet */
"HockeyFeedbackListDeleteAllTitle" = "Todas as mensagens do dispositivo serão eliminadas.";

/* Button Title to perform delete action */
"HockeyFeedbackListDeleteAllDelete" = "Eliminar";

/* Button Title to cancel delete action */
"HockeyFeedbackListDeleteAllCancel" = "Cancelar";


/* Open Link In Safari Action Sheet / Alert View */

/* Button Title to cancel */
"HockeyFeedbackListLinkActionCancel" = "Cancelar";

/* Button Title to Open the Link */
"HockeyFeedbackListLinkActionOpen" = "Abrir";

/* Button Title to Copy the Link */
"HockeyFeedbackListLinkActionCopy" = "Copiar";


/* UIActivity */

/* Activity Sharing Button Title, App Name will be inserted */
"HockeyFeedbackActivityButtonTitle" = "Comentário de %@";

/* if there can no app name be found, use this instead for HockeyFeedbackActivityButtonTitle */
"HockeyFeedbackActivityAppPlaceholder" = "Aplicação";


/* Compose Message */

/* Title */
"HockeyFeedbackComposeTitle" = "Novo comentário";

/* Send button */
"HockeyFeedbackComposeSend" = "Enviar";

/* Add Image button for attachment actions */
"HockeyFeedbackComposeAttachmentAddImage" = "Adicionar imagem";

/* Edit button for attachment actions */
"HockeyFeedbackComposeAttachmentEdit" = "Editar imagem";

/* Delete button for attachment actions */
"HockeyFeedbackComposeAttachmentDelete" = "Apagar imagem";

/* Cancel button for attachment actions */
"HockeyFeedbackComposeAttachmentCancel" = "Cancelar";


/* Set User Data */

/* Title */
"HockeyFeedbackUserDataTitle" = "Os meus dados";

/* Description On What Should Be Entered */
"HockeyFeedbackUserDataDescription" = "Forneça os seus dados antes de escrever o comentário.";

/* Name Field */
"HockeyFeedbackUserDataName" = "Nome";

/* Name Placeholder */
"HockeyFeedbackUserDataNamePlaceHolder" = "João Silva";

/* Email Field */
"HockeyFeedbackUserDataEmail" = "E-mail";

/* Email Placeholder */
"HockeyFeedbackUserDataEmailPlaceholder" = "email@exemplo.com";


/* Authenticator */

/* View Controller Title*/
"HockeyAuthenticatorViewControllerTitle" = "HockeyApp";

/* BITAuthenticatorAuthTypeUDIDProvider */
"HockeyAuthenticationViewControllerWebUDIDLoginDescription" = "O programador solicitou o UDID deste dispositivo. Toque em baixo para abrir o website do HockeyApp e autorizar o acesso.";
"HockeyAuthenticationViewControllerWebLoginButtonTitle" = "Abrir o HockeyApp";

/* BITAuthenticatorIdentificationTypeWebAuth */
"HockeyAuthenticationViewControllerWebAuthLoginDescription" = "O programador solicitou o endereço de e-mail e a palavra-passe da sua conta HockeyApp. Toque em baixo para abrir o website do HockeyApp e autorizar o acesso.";

/* BITAuthenticatorAuthTypeEmail and BITAuthenticatorAuthTypeEmailAndPassword */
"HockeyAuthenticationViewControllerDataEmailAndPasswordDescription" = "Introduza o endereço de e-mail e a palavra-passe da sua conta HockeyApp para autorizar o acesso a esta aplicação.";
"HockeyAuthenticationViewControllerDataEmailDescription" = "Introduza o endereço de e-mail da sua conta HockeyApp para autorizar o acesso a esta aplicação.";
"HockeyAuthenticationViewControllerEmailPlaceholder" = "email@exemplo.com";
"HockeyAuthenticationViewControllerPasswordPlaceholder" = "Necessário";
"HockeyAuthenticationViewControllerEmailDescription" = "E-mail";
"HockeyAuthenticationViewControllerPasswordDescription" = "Palavra-passe";

/* Error presented to the user if authentication failed because of networking issues */
"HockeyAuthenticationViewControllerNetworkError" = "Falha ao autorizar porque provavelmente o dispositivo não tem ligação à Internet. Tente novamente.";

"HockeyAuthenticationFailedAuthenticate" = "Falha ao autorizar. Tente novamente ou contacte o programador desta aplicação.";
"HockeyAuthenticationNotMember" = "Não está autorizado a utilizar esta aplicação. Contacte o programador desta aplicação.";
"HockeyAuthenticationContactDeveloper" = "Erro de autorização. Contacte o programador desta aplicação.";
"HockeyAuthenticationWrongEmailPassword" = "Introduziu um e-mail ou palavra-passe inválida. Verifique e tente novamente.";
"HockeyAuthenticationAuthSecretMissing" = "O \"authorization secret\" do HockeySDK não foi definido. Contacte o programador desta aplicação.";

/* Accessibility strings */
"HockeyAccessibilityHintRequired" = "Necessário";
